Revit 2026 API

# MassInstanceUtils Class

---

A static class that contains methods for processing curves driven by points.

SystemObject Autodesk.Revit.DBMassInstanceUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MassInstanceUtils : IDisposable
```
```vb
Public Class MassInstanceUtils
	Implements IDisposable
```
```cpp
public ref class MassInstanceUtils : IDisposable
```
```fsharp
type MassInstanceUtils =
    class
        interface IDisposable
    end
```

The MassInstanceUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddMassLevelDataToMassInstance | Create a MassLevelData (Mass Floor) to associate a Level with a mass instance. |
|  | Dispose | Releases all resources used by the MassInstanceUtils |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetGrossFloorArea | Get the total occupiable floor area represented by a mass instance. |
|  | GetGrossSurfaceArea | Get the total exterior building surface area represented by a mass instance. |
|  | GetGrossVolume | Get the total building volume represented by a mass instance. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetJoinedElementIds | Get the ElementIds of Elements that are joined to a mass instance. |
|  | GetMassLevelDataIds | Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance. |
|  | GetMassLevelIds | Get the ElementIds of the Levels associated with a mass instance. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveMassLevelDataFromMassInstance | Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace